use [Фирма по продаже автозапчастей]
go

select [Код детали], [Название детали],[Кол-во деталей на складе]
from Детали for xml raw('Детали'), root('Список_Деталей'),elements;

select [Код детали][@kod], [Название детали][@kod2],[Кол-во деталей на складе][@kod3]
from Детали for xml path('Детали'), root('Список_Деталей'),elements;

select [Код детали], [Название детали],[Кол-во деталей на складе]
from Детали for xml auto;

go
declare @h int = 0,
@sbj varchar(3000) = '<?xml version="1.0" encoding="windows-1251" ?>
                      <детали>
					     <деталь код=11 название="1" количество=5 артикул="1" примечание="1"/>
						 <деталь код=12 название="12" количество=9 артикул="1" примечание="1"/>
						 <деталь код=13 название="123" количество=6 артикул="1" примечание="1" />
					  </детали>';
exec sp_xml_preparedocument @h output, @sbj;
insert Детали select[код], [название], [количество], [артикул], [примечание] from openxml(@h, '/детали/деталь',0)
with([код] int, [название] nvarchar(50), [количество] int, [артикул] nvarchar(50), [примечание] nvarchar(50));