use [Фирма по продаже автозапчастей]
go

CREATE VIEW [Поставщик]
	as select [Код поставщика] [Код поставщика],
			  Название [Название],
			  Адрес [Адрес],
			  [Код поставки] [Код поставки] from Поставщики;
			  go

--CREATE VIEW Заказик(Телефон, Название)
--	as select 
--	Телефон,
--	Название
--	from Поставщики
--	where Название='АвтоТех'
--	go
--	select * from Заказик
--	insert Заказик values (4,'АлкоФест','ул.Держинского 122',16589,4)
--	go

CREATE VIEW [Товары]
	as select top 10 [Название детали] [Название],
			  Цена [Цена],
			  Артикул [Артикул],
			  [Кол-во деталей на складе] [Кол-во деталей на складе] from Детали
			  where Цена>3 with check option
			  go

UPDATE [Товары]
set Цена=1
go
CREATE VIEW [Товары1]
	as select top 10 [Название детали] [Название],
			  Цена [Цена],
			  Артикул [Артикул],
			  [Кол-во деталей на складе] [Кол-во деталей на складе] from Детали
			  order by Название
			  go


CREATE VIEW [Товары2] with schemabinding
	as select [Название детали] [Название],
			  Цена [Цена],
			  Артикул [Артикул],
			  [Кол-во деталей на складе] [Кол-во деталей на складе] from Детали
			  go

ALTER TABLE Детали drop column Цена